{
	"productIdentifier": "1227",
	"name": "Foreign Currency Account",
	"shortDescription": "With a Nedbank Foreign Currency Account you can save for travelling, invest or hedge your currency in eight currencies without having to pay monthly fees.",
	"productPricing": [],
	"specialFeature": "",
	"salesHighlights": [
		"You need only R1 500 in any of the eight international currencies to open an FCA.",
		"You can protect your investment against currency fluctuations without having to move money offshore.",
		"You can transfer money in a foreign currency to an account at an overseas bank (depending on exchange control regulations).",
		"You pay no monthly maintenance fees.",
		"You can buy currency and later transfer it to your Nedbank Travel Card when you travel.",
		"You can view your account balances and transaction history on the Nedbank Money app and Online Banking."
	],
	"redirect": {
		"shouldRedirect": false,
		"redirectUrl": null
	},
	"actions": [{
		"type": "REDIRECT",
		"text": "Select",
		"value": "https://www.nedbank.co.za/content/forms/af/nedbank/Foreign-Currency-Account-Application.html"
	},
	{
		"type": "DETAIL",
		"text": "Details"
	}],
	"productFeatures": [{
		"name": "MinimumCharge",
		"displayName": "Minimum charge",
		"description": "There are no monthly maintenance fees."
	}],
	"valueAddedServices": [
		"You can invest R1 million a year (single discretionary allowance) without needing a tax compliance status letter (also known as a tax clearance certificate) from the South African Revenue Services (SARS).",
		"You can have up to R10 million a year extra in foreign investment, but you will need a tax compliance status  letter from SARS.",
		"To deposit or withdraw money into or from your FCA, please send an email with your account number and the value of the transaction to FCA@nedbank.co.za."
	],
	"eligibilityRules": [{
		"attributeType": "EligibilityRule",
		"attributeName": "Age",
		"minValue": "18",
		"maxValue": "-1",
		"valueUnit": "year",
		"description": "No age restriction"
	}],
	"lifeCycleStatus": "AVAILABLE"
}