{
	"productIdentifier": "1096",
	"name": "Bondability",
	"shortDescription": "Taking care of your home loan in the event of death or disability with the option of full term or 24 months.",
	"productPricing": [{
		"type": "AdminFee",
		"amount": 0,
		"frequency": "monthly",
		"currency": "ZAR",
		"description": ""
	}],
	"specialFeature": "",
	"salesHighlights": ["Premiums are based on various rating factors, for example cover amount, age, gender, occupation, smoker status, education and income level.",
	"Maximum Cover Amount - R1500000",
	"Policy Term - 10, 15, 20, 25 or 30 yrs",
	"Underwriting - No medical underwriting or HIV testing",
	"Ease of application",
	"No medicals or HIV testing",
	"Tailored made home loan assurance relieves the homeowners of bond repayments in the event of : injury or illness resulting in the homeowners death or disability.",
	"Flexibility allows the level of security to be adjusted to accommodate budgetary and / or home loan increases",
	"Excess cover can provide additional security for financial needs",
	"Home loan assurance ensures that financial resources are not compromised by unsettled home loan obligations",
	"Provides additional security to the lending bank",
	"Up to 3 months free cover while bond registration pending ",
	"Death benefit - In the event of death BondAbility will pay a benefit equal to the specified cover amount. If the cover amount is greater than the outstanding home loan balance, the payment will provide additional funds to the family, which will be paid into the home loan account.",
	"Disability benefit - BondAbility pays the installments while the homeowner is unable to perform own their occupation or any other occupation reasonably fitted for, due to standard of education, training, experience or ability",
	"Instalment Protector Benefit - If either or both Lives Assured are prevented as a result of illness or bodily injury from working for a period of more than 90 days, monthly installments will be paid until both Lives Assured are sufficiently recovered"],
	"redirect": {
		"shouldRedirect": false,
		"redirectUrl": null
	},
	"actions": [{
		"type": "REDIRECT",
		"text": "Call me back",
		"value": "https://nedbank.co.za/content/forms/af/nedbank-insurance/InsuranceQuoteCMB.html?formType=quote&productType=Bond%20cover"
	},
	{
		"type": "DETAIL",
		"text": "Details"
	}],
	"valueAddedServices": [],
	"eligibilityRules": [],
	"lifeCycleStatus": "AVAILABLE"
}