{
	"productIdentifier": "1421",
	"name": "Accident and health insurance",
	"shortDescription": "Ensure your quality of life, no matter what happens.",
	"productPricing": [{
		"type": "AdminFee",
		"amount": 0,
		"frequency": "monthly",
		"currency": "ZAR",
		"description": ""
	}],
	"specialFeature": "",
	"salesHighlights": ["Premium varies depending on the cover amount",
	"Maximum Cover Amount - Health Assist Plan: Daily benefit of R3 000 per day, Personal Accident: maximum benefit between the range of R50, 000 and R700 000 (depending on the plan type). A maximum benefit payable for children age 6 months – 5 years is R10 000 and 6 - 14 years is R30 000.",
	"The Daily Hospital Benefit provides a payment, the Daily Hospital Benefit amount (sum insured) specified in the Policy Schedule, for each full day an Insured Person was Hospitalised as a result of an Accident, during the Period of Insurance.",
	"Nedgroup Insurance Company will calculate the period of Hospitalisation in accordance with the number of full days spent in a Hospital as a Resident In-Patient as a result of an Accident.",
	"The benefit payment shall be payable at the end of the period of Hospitalisation or when 30 (thirty) days' benefit is due, whichever is earlier.",
	"The Daily Hospital Benefit does not acquire any surrender value or paid-up value.",
	"Nedgroup Insurance Company will calculate the period of Hospitalisation in accordance with the number of full days spent in a Hospital as a Resident In-Patient as a result of an Accident.",
	"The benefit payment shall be payable at the end of the period of Hospitalisation or when 30 (thirty) days' benefit is due, whichever is earlier.",
	"The Daily Hospital Benefit does not acquire any surrender value or paid-up value.",
	"Personal Accident policies pay out a maximum benefit between the range of R50, 000 and R700 000 (depending on the plan that the client has elected).",
	"A maximum benefit payable for children age 6 months – 5 years is R10 000 and 6 - 14 years is R30 000.",
	"This policy offers the client worldwide cover, 24 hours a day.",
	"Benefits are payable if death or disablement resulting from an accident occurs within 12 months (365 days) of the date of the accident."],
	"redirect": {
		"shouldRedirect": false,
		"redirectUrl": null
	},
	"actions": [{
		"type": "REDIRECT",
		"text": "Call me back",
		"value": "https://nedbank.co.za/content/forms/af/nedbank-insurance/InsuranceQuoteCMB.html?formType=quote&productType=Life%20insurance"
	},
	{
		"type": "DETAIL",
		"text": "Details"
	}],
	"valueAddedServices": [],
	"eligibilityRules": [],
	"lifeCycleStatus": "AVAILABLE"
}