{
  "productIdentifier": 4232,
  "name": "Individual R30 000",
  "shortDescription": "Celebrate life today, knowing that tomorrow is taken care of.",
  "redirect": {
    "shouldRedirect": false,
    "redirectUrl": null
  },
  "salesHighlights": [
    "You can benefit from immediate accidental death cover.",
    "You will be covered for natural death after only six months.",
    "No medical tests are required to take out a funeral policy.",
    "A premium bonus every 12 months which is equal to the average premiums paid in the preceding 11 months.",
    "A no-lapse benefit - if you are experiencing financial difficulties and pay only part of your premium, your cover will be reduced but your policy will not lapse.",
    "Access to our Value For Life programme."
  ],
  "actions": [
    {
      "type": "SELECT",
      "text": "Select"
    },
    {
      "type": "DETAIL",
      "text": "Detail"
    },
    {
      "type": "COMPARE",
      "text": "Compare"
    }
  ],
  "applicationSteps": [
    {
      "index": 1,
      "name": "Choose extras",
      "Description": "Select optional extras for your account."
    },
    {
      "index": 2,
      "name": "About you",
      "Description": "We need personal details and other information to open this account."
    },
    {
      "index": 3,
      "name": "Customise",
      "Description": "Choose your preferences, including card delivery and staying in touch."
    },
    {
      "index": 4,
      "name": "Finishing up",
      "Description": "Finish the paperwork and activate your product!"
    }
  ],
  "productFeatures": [
    {
      "name": "Premium bonus",
      "displayName": "Premium bonus",
      "description": "Premium bonus: After 11 months’ premiums have been received, you'll get a premium holiday of 1 month."
    },
    {
      "name": "Extra premium bonus",
      "displayName": "Extra premium bonus",
      "description": "Extra premium bonus: If you pay 10 months' premiums in advance, you will be credited with an extra month’s premium, which together with the normal premium bonus gives you 12 months' cover."
    },
    {
      "name": "Grace period",
      "displayName": "Grace period",
      "description": "Grace period of 30 days: If you are unable to make a payment towards this policy in any month, you will have a 30-day grace period to make up for the non-payment."
    },
    {
      "name": "Allocated premium",
      "displayName": "Allocated premium",
      "description": "Allocated premium: To determine whether the right premium has been paid for the chosen cover, we calculate an allocated premium."
    },
    {
      "name": "Reduced cover amount",
      "displayName": "Reduced cover amount",
      "description": "Reduced cover amount: When we determine the amount payable for a valid claim, we look at the total amount of premiums we have received for the past six months and compare it with the total policy premium amount due for the past six months."
    },
    {
      "name": "Stillborn cover",
      "displayName": "Stillborn cover",
      "description": "Stillborn cover: Female main members and female partners (including more than one spouse, wife, common-law partner and customary-law wife) qualify automatically for stillborn cover of 12,5% of the main member’s cover. This benefit is limited to a maximum of two claims over the policy term and a maximum of R1 000 per claim."
    }
  ],
  "eligibilityRules": [
    {
      "attributeType": "EligibilityRule",
      "attributeName": "Age",
      "minValue": "18",
      "maxValue": "55",
      "valueUnit": "year",
      "description": "If you're over 18 years old, not older than 55 years old and a South African citizen, you can take out your policy today."
    }
  ],
  "lifeCycleStatus": "AVAILABLE",
  "productPricing": [],
  "specialFeature": "",
  "valueAddedServices": []
}