{
	"productIdentifier": "1157",
	"name": "Gold Funeral Plan",
	"shortDescription": "Closed to new business. Applicable only to existing policyholders",
	"productPricing": [{
		"type": "AdminFee",
		"amount": 0,
		"frequency": "monthly",
		"currency": "ZAR",
		"description": ""
	}],
	"actions": [{
		"type": "REDIRECT",
		"text": "Call me back",
		"value": "https://nedbank.co.za/content/forms/af/nedbank-insurance/InsuranceQuoteCMB.html?formType=quote&productType=Gold%20Funeral%20Plan"
	},
	{
		"type": "DETAIL",
		"text": "Details"
	}],
	"specialFeature": "",
	"salesHighlights": ["Premium - Individual: R21.50, R43.00, R64.50",
	"Premium - Family: R28.50, R57.00, R85.50",
	"Premium - Younger than 64: R31.50, R63.00, R94.50",
	"Premium - 65 and older: R70.00, R140.00, R210.00",
	"Maximum Cover Amount - R30 000",
	"Policy term - Death of the main member if no substitute main member is nominated.",
	"Policy term - If the premium is not received within 3 months of application the application will be cancelled",
	"Policy term - If a covered life no longer qualifies as a covered life ",
	"Underwriting - No medical underwriting or HIV testing",
	"Immediate accidental-death cover for you and your family from the date of receipt of the first premium.",
	"A tax-free lump sum benefit paid into your or your beneficiary's bank account.",
	"Maximum flexibility with a choice of three plans: An individual plan that covers only you, at a very affordable premium. A family plan that covers you, your spouse and your children. A parent plan that covers your parents and parents-in-law.",
	"Variable premium debit dates to meet your specific needs.",
	"Cover for life, provided you continue paying your premiums.",
	"The flexibility to adjust the level of cover.",
	"The flexibility to add additional children when they are born.",
	"The option to cover children older than 21 if they are fulltime students younger than 26 years.",
	"Settlement of all valid claims within 48 hours of receiving all the required documents and account details.",
	"A simple application process.",
	"A 30-day cooling-off period in which to cancel the policy if you are not entirely satisfied."],
	"redirect": {
		"shouldRedirect": false,
		"redirectUrl": null
	},
	"valueAddedServices": [],
	"eligibilityRules": [],
	"lifeCycleStatus": "AVAILABLE"
}