{
    "productIdentifier": "1028",
    "name": "The American Express Platinum Card",
    "shortDescription": "Enjoy a host of unmatched travel and lifestyle benefits. Get exclusive airline benefits and access to over 1 000 Airport Lounges around the world.",
    "extraInfoLine" : "A world where you can experience the privileges and services that you deserve.",
    "extraFeatureTextLine": "Enjoy privilege and prestige with the American Express Platinum Credit Card that offers a variety of exclusive features and added benefits.",
	"extraTexts": false,
    "redirect": {
        "shouldRedirect": false,
        "redirectUrl": null
    },
    "actions": [
        {
            "type": "SELECT",
            "text": "Select"
        },
        {
            "type": "DETAIL",
            "text": "Details"
        },
        {
            "type": "COMPARE",
            "text": "Compare"
        }
    ],
    "productPricing": [
        {
            "type": "AdminFee",
            "amount": 4450,
            "frequency": "Annually",
            "currency": "ZAR",
            "description": "R 4450.00 pa"
        }
    ],
    "eligibilityRules": [
        {
            "attributeType": "EligibilityRuleList",
            "description": "Is at least 18 years old;"
        },
        {
            "attributeType": "EligibilityRuleList",
            "description": "Is a South African resident or has a valid work permit;"
        },
        {
            "attributeType": "EligibilityRuleList",
            "description": "Earns R750 000 or more."
        }
    ],
    "salesHighlights": [
        "Enjoy privilege and prestige with the American Express Platinum Card that offers a variety of exclusive features and added benefits.",
        "Receive either a complimentary appetizer, 20% discount on food bills or a complimentary bottle of wine when paying your American Express Gold Card at participating restaurant. Click here for more info (link to https://www.americanexpress.com/uk/network/dining/)",
        "Discounted fares on multiple airlines including Emirates, Etihad and Qatar Airways.",
        "Complimentary access to over 1 000 airport lounges worldwide.",
        "Your dedicated Platinum Concierge service to take care of your travel and lifestyle plans, dinner reservations and tickets to sold out shows.",
        "Complimentary membership to the Avis Presidents Club and the Hertz Gold Plus Rewards Programme.",
        "Extra value worldwide across various Hotel Programmes including Fine Hotels and Resorts and The Hotel Collection.",
        "Automatic enrolment to the Membership Reward™ Programme where you will earn 1,5 MR points for every R5 of eligible spend.",
        "You can use balance tranfer features to pay your other bank’s credit debt."
    ],
    "valueAddedServices": [
        "You can also pay your balance over time. You can choose how much to pay; just pay in full, the minimum amount due, or anything in between - it's that simple.",
        "Enjoy remarkable basic worldwide protection for you, your partner, your children and your Supplementary Cardmembers which includes up to R10 million cover.",
        "Optional Comprehensive Top Cover is also available on all travel.",
        "Being a Platinum Cardmember entitles you to invitations to customised or exclusive events.",
        "Your American Express Platinum Card entitles you to one complimentary Platinum Supplementary and four complimentary Gold Supplementary Cards!",
        {
            "Balance Transfer": [
                "The balance transfer option enables you to transfer credit card debt held at another financial institution onto your Nedbank credit card helping you lower the cost of your credit card borrowings and consolidating multiple credit card debts.",
                "You get a preferential interest rate 9.9% over 6 months meaning you save on interest and pay a lower instalment for the balance transfer period.",
                "You can organise your finances by consolidating multiple monthly payments into one.",
                "You can transfer an amount that’s within the credit limit on your new card.",
                "If you choose to close your other credit cards you can also save on fees."
            ]
        }
    ],
    "additionalFeatures": [
        {
            "Hotel Programmes- Platinum brings you extra value all around the world including:": [
                "Fine Hotels and Resorts - get access to over 900 hand-selected, iconic five-star properties worldwide.",
                "The Hotel Collection - enjoy credits at more than 400 hotels in over 30 countries, including Hilton, Intercontinental and Mariott Hotels.",
                "The Vacation Collection - when you book two nights or more at most of our hotels, you can also receive a complimentary dining experience, spa treatment, resort credit offer or complimentary nights.",
                "Enjoy complimentary membership to the elite Preferred Golf programme, which boasts over 50 world-renowned golf resorts."
            ],
            "Enhanced Car Rental": [
                "Complimentary membership to Avis Preferred Plus where you will receive a free additional driver; guaranteed single vehicle upgrade at airport locations and a free weekend voucher.",
                "Complimentary Hertz Gold Plus Rewards membership where you will receive up to 1% discount off standard rates;one car class upgrade on rentals of five or more consecutive days (subject to availability); and a free additional driver."
            ],
            "Airport Lounge Access": [
                "Complimentary access to over 1 000 airport lounges worldwide including:",
                "Priority Pass™ Lounge*;",
                "Bidvest Premier Airport Lounges;",
                "The Centurion Lounges; and",
                "The American Express lounges.",
                "What's more, you can each bring a guest at no cost into all American Express and Priority Pass™ lounges when you travel."
            ]
        }
    ],
    "productOnAPageWebURL": "",
    "productAttributeGroup": [],
    "productFeatures": [
        {
            "name": "fee",
            "displayName": "Annual Fee",
            "description": "From R4450.00"
        },
        {
            "name": "income",
            "displayName": "Income Requirement",
            "description": "R 750000 pa"
        },
        {
            "name": "repayment",
            "displayName": "Repayment terms",
            "description": "For ease and convenience we offer a budget facility for larger than normal purchases which clients can then pay off over 3, 6, 12, 24 or 36 months."
        },
        {
            "name": "cashback",
            "displayName": "Points or Cashback",
            "description": "Membership Rewards (optional)"
        },
        {
            "name": "earnrate",
            "displayName": "Earn Rate",
            "description": "N/A"
        },
        {
            "name": "loyaltyprogram",
            "displayName": "Loyalty Program",
            "description": "Yes"
        },
        {
            "name": "internationallounges",
            "displayName": "International Lounges",
            "description": "Unlimited Priority Pass, Centurion Lounges and American Express lounges"
        },
        {
            "name": "companionticket",
            "displayName": "Companion Ticket",
            "description": "N/A"
        },
        {
            "name": "prioritypassmembership",
            "displayName": "Priority Pass Membership",
            "description": "Yes"
        },
        {
            "name": "localairportlounge",
            "displayName": "Local Airport Lounge",
            "description": "Unlimited"
        },
        {
            "name": "elitetiermemberships",
            "displayName": "Elite Tier memberships",
            "description": "N/A"
        },
        {
            "name": "travelservicesdesk",
            "displayName": "Travel Services Desk",
            "description": "Online Nedbank Travel Portal with exclusive offers"
        },
        {
            "name": "diningwineanddine",
            "displayName": "Dining/ Wine & Dine",
            "description": "No"
        },
        {
            "name": "plusspafitnesscinema",
            "displayName": "Plus/Spa & Fitness/Cinema",
            "description": "No"
        },
        {
            "name": "carhirebenefits",
            "displayName": "Car Hire Benefits",
            "description": "Avis Presidents Club and Hertz Gold Plus membership"
        },
        {
            "name": "exclusiveeventsplatform",
            "displayName": "Exclusive Events Platform",
            "description": "Yes"
        },
        {
            "name": "concierge",
            "displayName": "Concierge",
            "description": "Yes"
        },
        {
            "name": "purchaseprotection",
            "displayName": "Purchase Protection",
            "description": "Yes"
        },
        {
            "name": "fraudprotection",
            "displayName": "Fraud Protection",
            "description": "Yes"
        },
        {
            "name": "freecardreplacement",
            "displayName": "Free Card Replacement",
            "description": "No"
        }
    ],
    "lifeCycleStatus": "AVAILABLE",
    "requiredDocuments": [
        {
            "attributeType": "Display",
            "attributeName": "Payslip",
            "isComparable": "false",
            "valueUnit": "bool"
        },
        {
            "attributeType": "Display",
            "attributeName": "Proof of ID",
            "isComparable": "false",
            "valueUnit": "bool"
        }
    ]
}