{
	"productIdentifier": "1099",
	"name": "Credit card insurance",
	"shortDescription": "We'll take care of your credit card debt in the event of death, temprary and permanent disability, diagnosis of a critical illness or retrenchment.",
	"productPricing": [{
		"type": "AdminFee",
		"amount": 0,
		"frequency": "monthly",
		"currency": "ZAR",
		"description": ""
	}],
	"specialFeature": "",
	"salesHighlights": ["Balance Protection Plan - R3.89 per R1 000. (Premium is calculated on the highest outstanding balance from the last statement)",
	"Payment Protection Plan - R 7.90 per R 1 000. (Premium is calculated on the highest outstanding balance from the last statement)",
	"Balance protection Plan - Maximum cover is R100 000 for all benefits except retrenchment were the limit is R20 000.",
	"Payment Protection Plan - Maximum cover is R150 000 for all benefits except retrenchment were the limit is R20 000.",
	"Policy term - No Fixed Term",
	"You'll get peace of mind that your credit card debt will be taken care of so your family won't have to bear the financial burden.",
	"You can choose from two plans that have different cover limits: R100 000 or R150 000.",
	"If you pass away, get diagonsed with a critical illness or be permanently disabled we'll pay the full cover amount.",
	"If you are temporarily disabled we'll pay up to 6 monthly instalments under the credit agreement (five payments of 17.5% each and one payment of 12.5% of the cover amount), with an overriding maximum of 100% of the cover amount.",
	"If you are retrenched we'll pay up to 6 monthly installments equal to 10% of the cover amount paid unti life insured finds employment.",
	"Death benefit - In the event of death will pay the full cover amount.",
	"Disability benefit - In the event of permanent disabity will pay the full cover amount but for temporary disability will pay up to 6 monthly instalments under the credit agreement (five payments of 17.5% each and one payment of 12.5% of the cover amount), with an overriding maximum of 100% of the cover amount.",
	"Retrenchment benefit - In the event of retrenchment will pay up to 6 monthly installments equal to 10% of the cover amount paid unti life insured finds employment."],
	"redirect": {
		"shouldRedirect": false,
		"redirectUrl": null
	},
	"actions": [{
		"type": "REDIRECT",
		"text": "Call me back",
		"value": "https://nedbank.co.za/content/forms/af/nedbank-insurance/InsuranceQuoteCMB.html?formType=quote&productType=Credit%20card%20insurance"
	},
	{
		"type": "DETAIL",
		"text": "Details"
	}],
	"valueAddedServices": [],
	"eligibilityRules": [],
	"lifeCycleStatus": "AVAILABLE"
}